import { EvalulateForm } from "./types";

export const initialMockData: EvalulateForm[] = [
  {
    id: "1",
    indicatorName:
      "การดำเนินงานของฝ่ายบริหารทรัพยากรบุคคลกลุ่มการกิจ สำเร็จได้ตาม SLA งานเอกสารทั้งหมด 7 เรื่อง และงานให้คำปรึกษาให้ข้อมูล และแก้ไขปัญหาให้กับหน่วยงานรวมทั้งงานอื่นๆ ที่ได้รับมอบหมายจากผู้บริหารบัญชา ได้อย่างครบถ้วนถูกต้อง ตามกำหนดเวลา ไม่น้อยกว่าร้อยละ 90",
    unit: "ร้อยละ",
    weight: 20,
    target: 90,
    criteria:
      "เกณฑ์การวัดผล\n5 - โดดเด่น: ร้อยละ 98 - 100\n4 - ดีมาก: ร้อยละ 95 - 97\n3 - ดี: ร้อยละ 90 - 94\n2 - ต้องปรับปรุง: ร้อยละ 80 - 89\n1 - ยอมรับไม่ได้: น้อยกว่าร้อยละ 80",
  },
  {
    id: "2",
    indicatorName:
      "ผู้รับบริการจากฝ่ายบริหารทรัพยากรบุคคลกลุ่มการกิจ มีจำนวนไม่น้อยกว่าร้อยละ 70 ที่พึงพอใจในระดับพึงพอใจมากที่สุด",
    unit: "ร้อยละ",
    weight: 20,
    target: 70,
    criteria:
      "เกณฑ์การวัดผล\n5 - โดดเด่น: ร้อยละ 90 ขึ้นไป\n4 - ดีมาก: ร้อยละ 80 - 89\n3 - ดี: ร้อยละ 70 - 79\n2 - ต้องปรับปรุง: ร้อยละ 60 - 69\n1 - ยอมรับไม่ได้: น้อยกว่าร้อยละ 60",
  },
  {
    id: "3",
    indicatorName:
      "ดูแล บริหารจัดการระบบ PMIS รวมทั้งกำกับดูแลติดตามการดำเนินงานของหน่วยงานต่างๆ ในการตั้งเป้าหมายและการประเมินผลการปฏิบัติงานประจำปี ในระบบ PMIS รวมทั้งการจัดทำแผนพัฒนาการปฏิบัติงาน (PIP) และติดตามผลกับหน่วยงานต่างๆ ให้แล้วเสร็จอย่างถูกต้องครบถ้วนภายในกำหนด",
    unit: "ความสำเร็จ",
    weight: 20,
    target: 3,
    criteria:
      "เกณฑ์การวัดผล\n5 - โดดเด่น: ผ่านเกณฑ์ 4 และมีเอกสารหน่วยงานรักษาความรู้และได้ดำเนินงานกับหน่วยงานรักษาความรู้และได้ดำเนินงานกับหน่วยงานเพื่อให้เข้าใจเป้าหมายการปฏิบัติงาน และกระบวนการตั้งเป้าหมาย รวมถึงการจัดทำแผนพัฒนาการปฏิบัติงาน (PIP) ให้กับหน่วยงานต่างๆ ได้อย่างชัดเจน\n4 - ดีมาก: ผ่านเกณฑ์ 3 และสามารถให้หน่วยงานตั้งเป้าหมายการปฏิบัติงานและประเมินผลการปฏิบัติงาน รวมถึงจัดทำแผนพัฒนาการปฏิบัติงาน (PIP) ให้กับหน่วยงานต่างๆ ในระดับที่น่าพอใจได้อย่างน้อย 80% \n3 - ดี: มีหน่วยงานมีการตั้งเป้าหมายของประจำปีและแผนการปฏิบัติงานรวมถึงการประเมินผลการปฏิบัติงาน และสามารถดำเนินงานตามระบบ PMIS ด้านเป้าหมายประเมินผลและประเมินผลการปฏิบัติงานประจำปี การจัดทำแผนพัฒนาการปฏิบัติงาน (PIP) และติดตามผล ได้ครบถ้วนถูกต้อง ดำเนินงานในภาพรวม ไม่น้อยกว่าร้อยละ 100\n2 - ต้องปรับปรุง: ดำเนินการที่จำเป็นบางส่วน ภายในระยะเวลาที่กำหนด ไม่น้อยกว่าร้อยละ 80\n1 - ยอมรับไม่ได้: สำเร็จการดำเนินการที่จำเป็นบางส่วน ภายในเวลาที่กำหนด น้อยกว่าร้อยละ 80",
  },
  {
    id: "4",
    indicatorName:
      "จัดทำคู่มือ (แบบ Electronic File) ในงานที่เกี่ยวข้องของฝ่าย HRBP ให้หน่วยบริหารงานของหน่วยงานที่ สนค. ดูแล เพื่อเพิ่มประสิทธิภาพในการทำงานด้าน HR ให้ถูกต้องมากยิ่งขึ้น ให้เสร็จได้รับอนุมัติจาก ผอ.สบศ. และดำเนินการได้ภายใน 31 มี.ค. 67",
    unit: "ระยะเวลา",
    weight: 10,
    target: "31 มี.ค. 2567",
    criteria:
      "เกณฑ์การวัดผล\n5 - โดดเด่น: เสร็จภายใน ม.ค. 2567\n4 - ดีมาก: เสร็จภายใน ก.พ. 2567\n3 - ดี: เสร็จภายใน มี.ค. 2567\n2 - ต้องปรับปรุง: เสร็จภายใน เม.ย. 2567\n1 - ยอมรับไม่ได้: เสร็จภายใน พ.ค. 2567",
  },
];

export const initialMockEvaluationResult: string[] = [
  "ในปีงบประมาณ 2568 ผมได้รับมอบหมายให้ดำเนินงานด้านเอกสารตาม SLA รวมทั้งสิ้น 7 เรื่อง ซึ่งสามารถดำเนินการแล้วเสร็จภายใน ระยะเวลาที่กำหนดครบ 7 เรื่อง คิดเป็นความสำเร็จร้อยละ 95 ซึ่งเกินกว่าเป้าหมายที่กำหนดไว้นอกจากนี้ ผมยังได้ให้คำปรึกษา แก้ไขปัญหา และดำเนินงานอื่น ๆ ตามที่ได้รับมอบหมาย จากผู้บังคับบัญชาอย่างครบถ้วน ถูกต้อง และทันตามกรอบเวลาที่กำหนด ทำให้การดำเนินงานตลอดระยะเวลา 12 เดือน เป็นไปตามตัวชี้วัดที่ตั้งไว้ ไม่น้อยกว่าร้อยละ 90",
  "ในปีงบประมาณ 2568 ผมได้ให้บริการข้อมูล คำปรึกษา และสนับสนุนการดำเนินงาน แก่หน่วยงานต่าง ๆ ภายในองค์กรอย่างต่อเนื่อง โดยมุ่งเน้นความถูกต้อง ชัดเจน และทันเวลา ซึ่งจากผลการประเมินความพึงพอใจพบว่า ผู้รับบริการจากฝ่ายบริหารทรัพยากรบุคคลกลุ่มภารกิจไม่น้อยกว่าร้อยละ 70 แสดงความพึงพอใจ ในระดับ “พึงพอใจมาก” ถึง “พึงพอใจมากที่สุด” สอดคล้องกับเป้าหมายตัวชี้วัดที่กำหนดไว้ครับ",
  "ในปีงบประมาณ 2568 ผมได้ดูแล และบริหารจัดการระบบ PMIS อย่างต่อเนื่อง โดยกำกับและติดตามการตั้งเป้าหมาย รวมถึงการประเมินผลการปฏิบัติงานประจำปี ของหน่วยงานต่างๆ ในระบบ PMIS ได้อย่างถูกต้อง ครบถ้วน และตรงตามกรอบเวลาที่กำหนด นอกจากนี้ ผมยังรับผิดชอบจัดทำแผนพัฒนาการ ปฏิบัติงาน (PIP) พร้อมทั้งติดตามผลการดำเนิน งานร่วมกับหน่วยงานต่างๆ อย่างใกล้ชิด ทำให้สามารถบรรลุผลสำเร็จในระดับ “ดี” ตามเป้าหมายที่กำหนดไว้ครับ",
  "ในปีงบประมาณ 2568 ผมได้รับมอบหมายให้จัดทำคู่มือแบบ Electronic File สำหรับงานที่เกี่ยวข้องของฝ่าย HRBP เพื่อมอบให้กับผู้ประสานงานของหน่วยงานใน สบค. ดูแล โดยมุ่งเน้นเพิ่มประสิทธิภาพการทำงานด้าน HR ให้ถูกต้องและเป็นมาตรฐานเดียวกัน ซึ่งผมสามารถจัดทำและได้รับอนุมัติจาก ผอ.สบค. ภายในกำหนดวันที่ 31 มีนาคม 2568 สำเร็จเรียบร้อยครับ",
];
